Config/DataProcessors/LoadOrdersFrom1CRestaurantFO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>LoadOrdersFrom1CRestaurantFO</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataExchangeFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataExchangeFileEncoding</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FileEncoding</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataExchangeFileCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HistoryCatalog</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfFilesInHistory</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Enums/FileEncoding.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>FileEncoding</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ANSI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OEM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UTF16</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UTF8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>System</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/Folio.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Folio</Name>
			<BasedOn>
				<xr:Item>Catalog.ObjectTemplates</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosedAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolioCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
						<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
						<v8:Type>cfg:DocumentRef.ResourceReservation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Agent</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountCodeBO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTimeFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTimeTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreditLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsMaster</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotUpdateCompany</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotUpdateCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotFillAgent</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HotelProduct</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelProducts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecision</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DebtsDecisionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecisionAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecisionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebtDecisionRemarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolioDiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolioDiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LineNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsComplimentary</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsHouseUse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForDirectPostings</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForExternalPOS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsArchived</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/LoadOrdersFrom1CRestaurantFO/Ext/ObjectModule.bsl
#Region Public

// -----------------------------------------------------------------------------
Procedure pmLoadDataProcessorAttributes(pParameter = Undefined) Export
	cmLoadDataProcessorAttributes(ThisObject, pParameter);
EndProcedure // pmLoadDataProcessorAttributes

// -----------------------------------------------------------------------------
Procedure pmSaveDataProcessorAttributes() Export
	cmSaveDataProcessorAttributes(ThisObject);
EndProcedure // pmSaveDataProcessorAttributes

// -----------------------------------------------------------------------------
// Initialize attributes with default values
// Attention: This procedure could be called AFTER some attributes initialization
// routine, so it SHOULD NOT reset attributes being set before
// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	If Not ValueIsFilled(Hotel) Then
		Hotel = SessionParameters.CurrentHotel;
	EndIf;
	If ValueIsFilled(Hotel) Then
		If Not ValueIsFilled(DataExchangeFileCurrency) Then
			DataExchangeFileCurrency = Hotel.BaseCurrency;
		EndIf;
		If Not ValueIsFilled(Service) Then
			Service = Hotel.CateringService;
		EndIf;
	EndIf;
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
// Run data processor in silent mode
// -----------------------------------------------------------------------------
Procedure pmRun(pParameter = Undefined, pIsInteractive = False) Export
	// Load restaurant orders
	pmLoadOrders(pIsInteractive);
EndProcedure // pmRun

// -----------------------------------------------------------------------------
Procedure pmLoadOrders(pIsInteractive = False) Export
	WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Information, ThisObject.Metadata(), Undefined, NStr("en='Start of processing';ru='Начало выполнения';de='Anfang der Ausführung'"));
	// Check parameters
	If IsBlankString(DataExchangeFile) Then
		vMessage = NStr("ru = 'Не указан файл обмена данными!'; 
		                |de = 'Data exchange file is not set up!'; 
						|en = 'Data exchange file is not set up!'");
		WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Warning, ThisObject.Metadata(), Undefined, vMessage);
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
			Return;
		Else
			Raise vMessage;
		EndIf;
	EndIf;
	If Not ValueIsFilled(Service) Then
		vMessage = NStr("ru = 'Не указана услуга!'; 
		                |de = 'Service is not set up!'; 
						|en = 'Service is not set up!'");
		WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Warning, ThisObject.Metadata(), Undefined, vMessage);
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
			Return;
		Else
			Raise vMessage;
		EndIf;
	EndIf;
	If Not ValueIsFilled(DataExchangeFileCurrency) Then
		vMessage = NStr("ru = 'Не указана валюта файла обмена!'; 
		                |de = 'Data exchange file currency is not set up!';
						|en = 'Data exchange file currency is not set up!'");
		WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Warning, ThisObject.Metadata(), Undefined, vMessage);
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
			Return;
		Else
			Raise vMessage;
		EndIf;
	EndIf;
	vOrdersFile = New File(TrimAll(DataExchangeFile));
	If Not tcCommonFunctionOnClientServer.cmExists(vOrdersFile) Then
		vMessage = NStr("ru = 'Файл с выгруженными заказами ресторана не найден!'; 
						|en = 'Data exchange file with exported restaurant orders is not found!';
						|de = 'Data exchange file with exported restaurant orders is not found!'");
		WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Note, ThisObject.Metadata(), Undefined, vMessage);
		Return;
	EndIf;
	
	// Rename data exchange file to lock it from external change
	vDataExchangeFile = GetTempDataExchangeFileName(DataExchangeFile);
	vFileIsNotMoved = True;
	While vFileIsNotMoved Do
		Try
			MoveFile(DataExchangeFile, vDataExchangeFile);
			vFileIsNotMoved = False;
		Except
			// Wait some time
			i = 0;
			While i < 50000 Do
				i = i + 1;
			EndDo;
			
			// Check user interrupt processing
			If pIsInteractive Then
				#IF CLIENT THEN
					UserInterruptProcessing();
				#ENDIF
			EndIf;
		EndTry;
	EndDo;

	// Begin transaction if running on server
	If Not pIsInteractive Then
		BeginTransaction(DataLockControlMode.Managed);
	EndIf;
	
	// Open orders file
	vCount = 0;
	vOrders = New XBase();
	vOrders.Encoding = GetXBaseEncoding(DataExchangeFileEncoding);
	vOrders.ShowDeleted = False;
	vOrders.OpenFile(TrimAll(vDataExchangeFile), , True);
	If vOrders.First() Then
		While Not vOrders.EOF() Do
			Try
				vCount = vCount + 1;
				
				// Parse orders fields
				vOrderNumber = TrimAll(vOrders.NUMDOC);
				vOrderTime = Date(vOrders.DATE);
				vOrderTime = AddTime(vOrderTime, vOrders.TIME);
				vOrderCardCode = TrimAll(vOrders.CODECARD);
				vOrderCardID = TrimAll(vOrders.IDCARD);
				vOrderPlace = TrimAll(vOrders.NAMEREST);
				vOrderTable = TrimAll(vOrders.NUMPLACE);
				vOrderAuthor = TrimAll(vOrders.TNOFIC);
				
				vOrderSum = Number(vOrders.SUMBN);
				vOrderCashSum = Number(vOrders.SUMNAL);
				vOrderCreditSum = Number(vOrders.SUMCREDIT);
				vOrderNoPaymentSum = Number(vOrders.SUMNEPLAT);
				
				vOrderData = NStr("ru = 'Заказ №'; en = 'Order N'; de = 'Bestellung Nr.'") + vOrderNumber + NStr("en=' on ';ru=' от ';de=' vom '") + vOrderTime + " - " + vOrderPlace + NStr("ru = ', стол '; en = ', table '; de = ', Tisch '") + vOrderTable + " - " + vOrderAuthor;
				
				// Take room number description from the card code
				vRoomDescription = vOrderCardCode;
				// Take room code from the table number
				vRoomCode = vOrderTable;
				
				// Load order sum only
				If vOrderSum <> 0 Then
					// Check if room is filled
					vSkipLoading = False;
					vRoomRef = Catalogs.Rooms.EmptyRef();
					If Not IsBlankString(vRoomDescription) Or Not IsBlankString(vRoomCode) Then
						If Not IsBlankString(vRoomCode) Then
							vRoomRef = Catalogs.Rooms.FindByDescription(vRoomCode, True, , Hotel);
						EndIf;
						If Not ValueIsFilled(vRoomRef) Then
							If Not IsBlankString(vRoomDescription) Then
								vRoomRef = Catalogs.Rooms.FindByDescription(vRoomDescription, True, , Hotel);
							EndIf;
						EndIf;
						If Not ValueIsFilled(vRoomRef) Then
							// Skip this order cause this order do not have reference to the room
							vSkipLoading = True;
							
							vMessage= NStr("ru = 'Пропущен заказ на стол '; en = 'Skip loading order from table '; de = 'Skip loading order from table '") + vOrderTable + "!" + Chars.LF + vOrderData;
							WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Note, ThisObject.Metadata(), , vMessage);
							If pIsInteractive Then
								tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Important);
							EndIf;
						EndIf;
					Else
						// Skip this order cause this order do not have reference to the room
						vSkipLoading = True;
						
						vMessage= NStr("ru = 'Пропущен заказ без указания стола!'; en = 'Skip loading order without table!'; de = 'Skip loading order without table!'") + Chars.LF + vOrderData;
						WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Note, ThisObject.Metadata(), , vMessage);
						If pIsInteractive Then
							tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Important);
						EndIf;
					EndIf;
					
					// Try to create interface document
					If Not vSkipLoading Then
						WriteOrder(vRoomRef, vOrderTime, vOrderSum, vOrderAuthor, vOrderData, pIsInteractive);
					EndIf;
				EndIf;
			Except
				vMessage = ErrorDescription();
				WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Warning, ThisObject.Metadata(), , vMessage);
				
				If pIsInteractive Then
					tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
				Else
					// Rollback transaction if running on server
					RollbackTransaction();
					
					// Rename file back
					If vOrders.IsOpen() Then
						vOrders.CloseFile();
					EndIf;
					MoveFile(vDataExchangeFile, DataExchangeFile);
					
					Raise vMessage;
				EndIf;
			EndTry;
			
			// Go to the previous record
			vOrders.Next();
			
			// Check user interrupt processing
			If pIsInteractive Then
				#IF CLIENT THEN
					UserInterruptProcessing();
				#ENDIF
			EndIf;
		EndDo;
	EndIf;
						
	If vOrders.IsOpen() Then
		vOrders.CloseFile();
	EndIf;
	
	// Commit transaction if running on server
	If Not pIsInteractive Then
		CommitTransaction();
	EndIf;
	
	// Move export file to the history catalog
	If Not IsBlankString(HistoryCatalog) Then
		If NumberOfFilesInHistory > 0 Then
			vHistoryDataExchangeFile = GetHistoryDataExchangeFileName(DataExchangeFile);
			MoveFile(vDataExchangeFile, vHistoryDataExchangeFile);
			// Delete old files
			vFilesArray = FindFiles(TrimAll(HistoryCatalog), "*.dbf");
			If vFilesArray.Count() > 0 Then
				vFilesList = New ValueList();
				For Each vFile In vFilesArray Do
					vFileItem = vFilesList.Add(vFile, vFile.Name);
				EndDo;
				vFilesList.SortByPresentation(SortDirection.Asc);
				While vFilesList.Count() > NumberOfFilesInHistory Do
					vFileItem = vFilesList.Get(0);
					DeleteFiles(vFileItem.Value.FullName);
					vFilesList.Delete(0);
				EndDo;
			EndIf;
		EndIf;
	EndIf;
	
	// Log that processing is finished
	WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Information, ThisObject.Metadata(), Undefined, NStr("ru = 'Конец выполнения процедуры загрузки заказов ресторана. Загружено " + vCount + " записей.'; en = 'End of loading orders. " + vCount + " orders were loaded.'; de = 'End of loading orders. " + vCount + " orders were loaded.'"));
EndProcedure // pmLoadOrders

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
Function AddTime(pDate, pTime)
	vHours = Number(Left(pTime, 2));
	vMinutes = Number(Mid(pTime, 4, 2));
	vSeconds = Number(Right(pTime, 2));
	Return BegOfday(pDate) + vHours*3600 + vMinutes*60 + vSeconds;
EndFunction // AddTime

// -----------------------------------------------------------------------------
Function GetTempDataExchangeFileName(pDataExchangeFile)
	vExt = Right(TrimR(pDataExchangeFile), 4);
	vLeft = Left(pDataExchangeFile, StrLen(TrimR(pDataExchangeFile))-4);
	Return vLeft + "~" + vExt;
EndFunction // GetTempDataExchangeFileName

// -----------------------------------------------------------------------------
Function GetHistoryDataExchangeFileName(pDataExchangeFile)
	vFile = New File(pDataExchangeFile);
	vFileName = TrimAll(vFile.BaseName);
	vExt = Right(pDataExchangeFile, 4);
	vHistoryCatalog = TrimAll(HistoryCatalog);
	If Right(vHistoryCatalog, 1) <> "\" And Right(vHistoryCatalog, 1) <> "/" Then
		vHistoryCatalog = vHistoryCatalog + "\";
	EndIf;
	Return vHistoryCatalog + vFileName + "_" + Format(CurrentSessionDate(), "DF=yyyyMMddHHmmss") + vExt;
EndFunction // GetHistoryDataExchangeFileName

// -----------------------------------------------------------------------------
Function GetXBaseEncoding(pDataExchangeFileEncoding)
	If pDataExchangeFileEncoding = Enums.FileEncoding.OEM Then
		Return XBaseEncoding.OEM;
	Else
		Return XBaseEncoding.ANSI;
	EndIf;
EndFunction // GetXBaseEncoding

// -----------------------------------------------------------------------------
Procedure WriteOrder(pRoom, pOrderTime, pOrderSum, pOrderAuthor, pOrderData, pIsInteractive)
	// Create new interface document object
	vRoomServiceObj = Documents.RecordRoomService.CreateDocument();
	vRoomServiceObj.Hotel = Hotel;
	vRoomServiceObj.pmFillAuthorAndDate();
	vRoomServiceObj.SetNewNumber();
	vRoomServiceObj.pmFillAttributesWithDefaultValues();
	
	// Fill order sum
	vRoomServiceObj.RoomService = Service;
	vRoomServiceObj.Unit = Service.Unit;
	vRoomServiceObj.RoomServiceChargeType = NStr("en='Restaurant';ru='Ресторан';de='Restaurant'");
	vRoomServiceObj.Price = pOrderSum;
	vRoomServiceObj.Quantity = 1;
	vRoomServiceObj.Sum = pOrderSum;
	
	// Fill currency attributes
	vRoomServiceObj.Currency = DataExchangeFileCurrency;
	vRoomServiceObj.CurrencyExchangeRate = cmGetCurrencyExchangeRate(vRoomServiceObj.Hotel, vRoomServiceObj.Currency, vRoomServiceObj.ExchangeRateDate);
	
	// Fill call attributes
	vRoomServiceObj.ServiceDate = pOrderTime;
	
	// Try to find folio to charge to
	vRoomServiceObj.Room = pRoom;
	If ValueIsFilled(vRoomServiceObj.Room) Then
		If ValueIsFilled(vRoomServiceObj.Room.Company) Then
			vRoomServiceObj.Company = vRoomServiceObj.Room.Company;
			If Not ValueIsFilled(vRoomServiceObj.RoomService) Then
				vRoomServiceObj.VATRate = vRoomServiceObj.Company.VATRate;
			EndIf;
			If Not ValueIsFilled(vRoomServiceObj.FixedService) Then
				vRoomServiceObj.FixedServiceVATRate = vRoomServiceObj.Company.VATRate;
			EndIf;
		EndIf;
		vRoomServiceObj.Folio = vRoomServiceObj.pmGetFolioToChargeTo();
	EndIf;
	
	// Try to find active room folio
	If Not ValueIsFilled(vRoomServiceObj.Folio) Then
		vFolios = cmGetActiveRoomFolios(Hotel, vRoomServiceObj.Room, Hotel.FolioCurrency);
		If vFolios.Count() > 0 Then
			vRow = vFolios.Get(0);
			vRoomServiceObj.Folio = vRow.Folio;
		EndIf;
	EndIf;
	// Create new empty one
	If Not ValueIsFilled(vRoomServiceObj.Folio) Then
		vFolioObj = Documents.Folio.CreateDocument();
		vFolioObj.Hotel = Hotel;
		vFolioObj.pmFillAttributesWithDefaultValues();
		vFolioObj.Room = vRoomServiceObj.Room;
		vFolioObj.Description = NStr("en='Restaurant orders on vacant rooms';ru='Заказы ресторана на свободные номера';de='Restaurantbestellungen auf freie Plätze'");
		vFolioObj.Write(DocumentWriteMode.Write);
		
		vRoomServiceObj.Folio = vFolioObj.Ref;
		
		vMessage = NStr("ru = 'Создано фолио: " + String(vRoomServiceObj.Folio) + "'; 
		                |de = 'Folio " + String(vRoomServiceObj.Folio) + " was created'; 
						|en = 'Folio " + String(vRoomServiceObj.Folio) + " was created'");
		WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Note, vRoomServiceObj.Folio.Metadata(), vRoomServiceObj.Folio, vMessage);
	EndIf;
	
	// Process folio
	vRoomServiceObj.pmFillByFolio();
	vRoomServiceObj.pmRecalculateSums();
	
	// Fill remarks
	vRoomServiceObj.Remarks = pOrderData;
	
	// Post current document
	vRoomServiceObj.Write(DocumentWriteMode.Posting);
				
	// Log current state
	vMessage = NStr("ru = 'Создан документ: " + String(vRoomServiceObj.Ref) + "'; 
	                |de = 'Document " + String(vRoomServiceObj.Ref) + " was created'; 
					|en = 'Document " + String(vRoomServiceObj.Ref) + " was created'") + Chars.LF + pOrderData;
	WriteLogEvent(NStr("en='DataProcessor.LoadOrdersFrom1CRestaurantFO'; de='DataProcessor.LoadOrdersFrom1CRestaurantFO'; ru='Обработка.ЗагрузкаЗаказовРесторанаИз1СФО'"), EventLogLevel.Information, ThisObject.Metadata(), vRoomServiceObj.Ref, vMessage);
	If pIsInteractive Then
		tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Information);
	Endif;
EndProcedure // WriteOrder

#EndRegion
